{
  "vocab_size": 10000,
  "special_tokens": [
    "<unk>",
    "<pad>",
    "<bos>",
    "<eos>",
    "<system>",
    "<user>",
    "<assistant>",
    "[CONTEXT_PREV_SENT]",
    "[EMO_ANGER]",
    "[EMO_SADNESS]",
    "[EMO_JOY]",
    "[EMO_LOVE]",
    "[EMO_FEAR]",
    "[EMO_SURPRISE]",
    "[EMO_NEUTRAL]",
    "[EMO_UNKNOWN]",
    "[EMO_ADMIRATION]",
    "[EMO_AMUSEMENT]",
    "[EMO_ANNOYANCE]",
    "[EMO_APPROVAL]",
    "[EMO_CARING]",
    "[EMO_CONFUSION]",
    "[EMO_CURIOSITY]",
    "[EMO_DESIRE]",
    "[EMO_DISAPPOINTMENT]",
    "[EMO_DISAPPROVAL]",
    "[EMO_DISGUST]",
    "[EMO_EMBARRASSMENT]",
    "[EMO_EXCITEMENT]",
    "[EMO_GRATITUDE]",
    "[EMO_GRIEF]",
    "[EMO_NERVOUSNESS]",
    "[EMO_OPTIMISM]",
    "[EMO_PRIDE]",
    "[EMO_REALIZATION]",
    "[EMO_RELIEF]",
    "[PUNCT_QUESTION]",
    "[PUNCT_EXCLAMATION]"
  ],
  "context_tokens": ["[CONTEXT_PREV_SENT]"],
  "oov_token": "<unk>",
  "context_window_size": 3,
    "emotion_labels": [
        "admiration",
        "amusement",
        "anger",
        "annoyance",
        "approval",
        "caring",
        "confusion",
        "curiosity",
        "desire",
        "disappointment",
        "disapproval",
        "disgust",
        "embarrassment",
        "excitement",
        "fear",
        "gratitude",
        "grief",
        "joy",
        "love",
        "nervousness",
        "optimism",
        "pride",
        "realization",
        "relief",
        "sadness",
        "surprise",
        "neutral"
    ]
}
